import tkinter as tk

WINDOW_WIDTH = 1200
WINDOW_HEIGHT = 800

font = ("", 20)

btn_n = 3
story = [["のぼるの体重クエスト〇◎●💮❂",["やる",1],["やらない",2],["高難易度をやる",26]],["のぼるの体重を減らそう！",["やる",7],["やだ",2],["絶対無理",6]],["ばいばい",["ばいばい",-1],["さようなら",-1],["こんにちは",-1]],
         ["未実装だよ",["もどる",0],["やめる",-1],["発狂する",4]],["うるせえ",["発狂する",4],["もどる",0],["のぼる",5]],["いわもとのぼのぼのぼたんたん♪",["おわる",-1],["おわる",-1],["おわる",-1]],
         ["それな",["おわる",-1],["がんばる",7],["のぼる",5]],["のぼるの体重は？",["63kg",9],["68kg",10],["78kg",8]],["ゲームクリア！　クリアコード：0",["もういっかい",0],["のぼるのおなか",9],["おわる",-1]],
         ["ゲームオーバー💀",["おわる",-1],["やめる",-1],["のぼる",5]],["のぼるに何を与える？",["パフェ",11],["コーヒー",22],["のぼる",5]],["のぼるは太った！どうする？",["おなかをさわる",12],["筋トレさせる",14],["いわもとのぼる",5]],
         ["ぶよぶよ！",["もっとさわる",13],["食べ物を与える",9],["発狂する",4]],["ぶよぶよ！",["もっとさわる",8],["食べ物を与える",9],["発狂する",4]],["何の筋トレ？",["腹筋",15],["腕立て",15],["ランニング(筋トレ？)",19]],
         ["何回？",["３",16],["１００",17],["５０００",18]],["のぼるは痩せられなかった",["あきらめる",9],["もっと筋トレ",14],["おなかをさわる",12]],["それでものぼるの体重は減らない！",["あきらめる",9],["もっと筋トレ",14],["発狂する",4]],
         ["のぼるは死んでしまった！ ゲームオーバー",["おわる",-1],["発狂する",4],["のぼる",5]],["どれぐらい？",["１０km",20],["１時間",20],["３日",18]],["のぼるはすこしやせた！",["おかしをあたえる",21],["おなかをさわる",12],["いわもとのぼる",5]],
         ["のぼるはリバウンドした！",["あきらめる",9],["もっと筋トレ",14],["発狂する",4]],["のぼるは脳死状態になった！",["あきらめる",9],["おなかをさわる",12],["将棋をする",23]],["勝利！",["食べ物を与える",10],["発狂する",4],["寝かせる",24]],
         ["のぼるの脳は直った！",["おなかをさわる",12],["筋トレさせる",14],["いわもとのぼる",25]],["congratulation!　クリアコード：1",["おめでとう",9],["げーむ",-1],["くりあ！",-1]],["どれをやる？",["むずい",28],["めっちゃむずい",3],["もっとむずい",27]],
         ["どれをやる？",["やばい",3],["やばすぎて〇ぬ",18],["難易度MAX",3]],["のぼるをどうする？",["痩せさせる",29],["太らせる",29],["ボディビル",3]],["のぼるの体重は？",["68kg",30],["78kg",999],["101kg",999]],
         ["のぼるに何をする？今の体重：68kg",["筋トレさせる",31],["お菓子をあげる",40],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",32],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",33],["２０００",170]],
         ["のぼるはすこしやせた！",["おかしをあたえる",34],["おなかをさわる",131],["いわもとのぼる",5]],["何をあたえる？",["パフェ",97],["ホールケーキ",35],["青汁",999]],["のぼるは太った！",["続ける",36],["あきらめる",9],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：71kg",["筋トレさせる",37],["お菓子をあげる",46],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",38],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",39],["２０００",171]],
         ["のぼるはすこしやせた！",["おかしをあたえる",40],["おなかをさわる",131],["いわもとのぼる",5]],["何をあたえる？",["パフェ",97],["ホールケーキ",41],["青汁",33]],["のぼるは太った！",["続ける",42],["あきらめる",98],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：74kg",["筋トレさせる",43],["お菓子をあげる",52],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",44],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",45],["２０００",170]],
         ["のぼるはすこしやせた！",["おかしをあたえる",46],["おなかをさわる",131],["いわもとのぼる",5]],["何をあたえる？",["パフェ",97],["ホールケーキ",47],["青汁",39]],["のぼるは太った！",["続ける",48],["あきらめる",98],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：77kg",["筋トレさせる",49],["お菓子をあげる",58],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",50],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",51],["２０００",172]],
         ["のぼるはすこしやせた！",["おかしをあたえる",52],["おなかをさわる",131],["いわもとのぼる",5]],["何をあたえる？",["パフェ",96],["ホールケーキ",53],["青汁",45]],["のぼるは太った！",["続ける",54],["あきらめる",9],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：80kg",["筋トレさせる",55],["お菓子をあげる",64],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",56],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",57],["２０００",170]],
         ["のぼるはすこしやせた！",["おかしをあたえる",58],["おなかをさわる",133],["いわもとのぼる",5]],["何をあたえる？",["パフェ",97],["ホールケーキ",59],["青汁",51]],["のぼるは太った！",["続ける",60],["あきらめる",98],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：83kg",["筋トレさせる",61],["お菓子をあげる",70],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",62],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",63],["２０００",171]],
         ["のぼるはすこしやせた！",["おかしをあたえる",64],["おなかをさわる",133],["いわもとのぼる",5]],["何をあたえる？",["パフェ",97],["ホールケーキ",65],["青汁",57]],["のぼるは太った！",["続ける",66],["あきらめる",9],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：86kg",["筋トレさせる",67],["お菓子をあげる",76],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",68],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",69],["２０００",173]],
         ["のぼるはすこしやせた！",["おかしをあたえる",70],["おなかをさわる",999],["いわもとのぼる",5]],["何をあたえる？",["パフェ",96],["ホールケーキ",71],["青汁",63]],["のぼるは太った！",["続ける",72],["あきらめる",98],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：89kg",["筋トレさせる",73],["お菓子をあげる",82],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",74],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",75],["２０００",170]],
         ["のぼるはすこしやせた！",["おかしをあたえる",76],["おなかをさわる",999],["いわもとのぼる",5]],["何をあたえる？",["パフェ",97],["ホールケーキ",77],["青汁",69]],["のぼるは太った！",["続ける",78],["あきらめる",9],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：92kg",["筋トレさせる",79],["お菓子をあげる",88],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",80],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",81],["２０００",172]],
         ["のぼるはすこしやせた！",["おかしをあたえる",82],["おなかをさわる",999],["いわもとのぼる",5]],["何をあたえる？",["パフェ",97],["ホールケーキ",83],["青汁",75]],["のぼるは太った！",["続ける",84],["あきらめる",9],["いわもとのぼる",5]],
         ["のぼるに何をする？今の体重：95kg",["筋トレさせる",85],["お菓子をあげる",95],["いわもとのぼる",5]],["何の筋トレ？",["腹筋",86],["腕立て",15],["空中浮遊",999]],["何回？",["１００",17],["５００",87],["２０００",171]],
         ["のぼるはすこしやせた！",["おかしをあたえる",88],["おなかをさわる",999],["いわもとのぼる",5]],["何をあたえる？",["パフェ",83],["ホールケーキ",89],["青汁",81]],["のぼるは太りすぎた！ゲームオーバー(´ﾟдﾟ｀)",["やりなおす",90],["あきらめる",2],["発狂する",999]],
         ["ダメ～～～～～w",["やりなおす",91],["もういっかい",92],["すみませんでした、もう一度やらせてください",93]],["ダメ～～～～～w",["やりなおす",92],["もういっかい",90],["すみませんでした、もう一度やらせてください",92]],["ダメ～～～～～w",["やりなおす",91],["もういっかい",92],["すみませんでした、もう一度やらせてください",91]],
         ["仕方ないなぁ、やさしさだよ？",["ありがとうございます！",94],["恩に着るぜ！",0],["聖人！天才！人類の希望！",6]],["やっぱダメ～～～～～www",["おわる",94],["あきらめる",94],["のぼる",5]],["何をあたえる？",["パフェ",89],["ホールケーキ",999],["ウェディングケーキ",275]],
         ["のぼるは太った！",["あきらめる",9],["筋トレ",154],["発狂する",4]],["のぼるは太った！",["あきらめる",9],["筋トレ",14],["発狂する",4]],["あきらめんな！",["続ける！",72],["あきらめる！",99],["いわもとのぼる!",114]],
         ["ばいばい！",["ばいばい！",-1],["さようなら！",-1],["こんにちは！",-1]],["い！",["わ",101],["も",102],["と",103]],["わ！",["も",102],["と",103],["の",104]], #99-101
         ["も！",["と",103],["の",104],["ぼ",105]],["と！",["の",104],["ぼ",105],["る",106]],["の！",["ぼ",105],["る",106],["ぼ",105]],
         ["ぼ！",["の",104],["の",104],["た",107]],["る！",["い",100],["わ",101],["か",111]],["た！",["わ",101],["を",110],["ん",108]],
         ["ん！",["た",107],["た",107],["♪",109]],["いわもとのぼのぼのぼたんたん！！！",["おわる！",-1],["おわる！",-1],["おわる！",-1]],["を！",["か",111],["を",110],["お",112]],
         ["か！",["お",112],["を",110],["こ",113]],["お！",["を",110],["を",110],["を",110]],["こ！",["こ",113],["を",110],["も",102]],
         ["い！",["わ",115],["も",102],["と",103]],["わ！",["も",116],["と",103],["の",104]],["も！",["と",117],["の",104],["ぼ",105]],#####
         ["と！",["の",118],["ぼ",105],["る",106]],["の！",["ぼ",119],["る",106],["ぼ",105]],["ぼ！",["の",120],["の",104],["た",107]],
         ["の！",["ぼ",105],["る",106],["ぼ",121]],["ぼ！",["の",104],["の",122],["た",107]],["の！",["ぼ",123],["る",106],["ぼ",123]],
         ["ぼ！",["の",104],["の",104],["た",124]],["た！",["わ",101],["を",110],["ん",125]],["ん！",["た",126],["た",126],["♪",109]],
         ["た！",["わ",101],["を",110],["ん",127]],["ん！",["た",107],["た",107],["♪",128]],["選べ!!!!!",["のぼる！！！",129],["のぼる！！！",130],["のぼる！！！",109]],
         ["ゲームクリア！！　クリアコード：2",["おわる",-1],["続ける",9],["のぼる",5]],["うるせえ",["発狂する",130],["もどる",100],["のぼる",5]],["ぶよぶよ！",["もっとさわる",131],["食べ物を与える",9],["発狂する",132]],
         ["うるせえ",["発狂する",132],["もどる",131],["のぼる",5]],["ぶっよぶよ！",["もっとさわる",134],["食べ物を与える",64],["発狂する",140]],["ぶっよぶよ！",["もっとさわる",135],["食べ物を与える",64],["発狂する",140]],
         ["ぶっよぶよ！",["もっとさわる",136],["食べ物を与える",64],["発狂する",140]],["ぶっよぶよ！",["もっとさわる",137],["食べ物を与える",64],["発狂する",140]],["ぶっよぶよ！",["もっとさわる",138],["食べ物を与える",64],["発狂する",140]],
         ["ぶっよぶよ！",["もっとさわる",139],["食べ物を与える",64],["発狂する",140]],["ぶっよぶよ！",["もっとさわる",133],["食べ物を与える",64],["発狂する",141]],["うるせえ",["発狂する",140],["もどる",142],["のぼる",5]],
         ["うるせえ",["発狂する",140],["もどる",142],["のぼる",143]],["戻らせない★",["じゃあ戻らない",144],["それでも戻りたいんだッ！",145],["そうかそうか、つまり君は(ry",153]],["congratulation!!　クリアコード：3",["お！",9],["め！",-1],["でとうございます！",-1]],
         ["戻らせない★",["永遠の",144],["時を",144],["この場所で",144]],["うるせえだまれしゃべんなもどらせるわけねえだろ",["それでも戻りたいんだッ！",146],["それでもッ戻りッたいんだッ！",146],["戻りたい(泣)",147]],["うるせえだまれしゃべんなもどらせるわけねえだろ",["それでも戻りたいんだッ！",146],["それでもッ戻りッたいんだッ！",146],["戻りたい(泣)",146]],
         ["泣いてやんのwww",["おこる",151],["もどる",148],["のぼる",5]],["もどれないよ★",["あきらめる",-1],["あきらめない",149],["あきらめる",150]],["あきらめろ",["あきらめる",-1],["あきらめない",149],["あきらめる",-1]],
         ["ゲームクリア！！　クリアコード：4",["ここを押すとクリア",9],["ここを押すとゲームオーバー",9],["ここを押すといわもとのぼる",-1]],["ブチギレで草wwww",["〇ね",152],["〇すぞ",152],["〇〇〇〇〇〇〇〇〇〇〇",152]],["コンプライアンス違反によりBANされました",["",152],["",152],["",152]],#150-152
         ["スランプによりゲームオーバー",["スランプなら",-1],["しょうがないね",-1],["。",-1]],["★☆★筋トレ☆★☆",["続ける！",155],["続ける！",155],["続ける！",155]],["何　の　筋　ト　レ　？",["腹　筋",156],["腕　立　て",156],["空　中　浮　遊",999]],
         ["何　回　？",["１００",157],["１０００",157],["１００００",158]],["のぼるはやせない！！",["もっと！",156],["もっともっと！",156],["いわもっと！！",109]],["のぼるを応援しろ！！",["頑張れ！",159],["お前ならできる！",159],["いい加減に痩せろ！",159]],
         ["のぼるを応援しろ！！",["頑張れ！",159],["お前ならできる！",160],["いい加減に痩せろ！",165]],["のぼるを応援しろ！！",["頑張れ！",161],["お前ならできる！",158],["いい加減に痩せろ！",161]],["のぼるを応援しろ！！",["頑張れ！",165],["お前ならできる！",163],["いい加減に痩せろ！",162]],
         ["のぼるを応援しろ！！",["頑張れ！",163],["お前ならできる！",165],["いい加減に痩せろ！",159]],["のぼるを応援しろ！！",["頑張れ！",162],["お前ならできる！",163],["いい加減に痩せろ！",164]],["のぼるはやせた！！　クリアコード：5",["おめでとう！",0],["ありがとう！",0],["ぶよぶよ！",9]],
         ["のぼるを応援しろ！！",["頑張れ！",165],["お前ならできる！",166],["いい加減に痩せろ！",167]],["のぼるを応援しろ！！",["頑張れ！",167],["お前ならできる！",167],["いい加減に痩せろ！",165]],["のぼるを応援しろ！！",["頑張れ！",165],["お前ならできる！",168],["いい加減に痩せろ！",168]],
         ["のぼるはやせられなかった...",["つづける",0],["おわる",-1],["のぼる",169]],["いわもとのぼのぼのぼたんたん...",["おわる",-1],["おわる",-1],["おわる",-1]],["〇　ダイエットチャンス　〇",["やる",174],["やらない",178],["やらない",178]],
         ["◎　ダイエットチャンス　◎",["やる",175],["やらない",178],["やらない",178]],["✪　ダイエットチャンス　✪",["やる",176],["やらない",178],["やらない",178]],["❂　ダイエットチャンス　❂",["やる",177],["やらない",178],["やらない",178]],
         ["選べ！",["連打",180],["将棋",220],["徹夜",240]],["選べ！",["連打",190],["将棋",221],["徹夜",253]],["選べ！",["連打",200],["将棋",222],["徹夜",257]],
         ["選べ！",["連打",210],["将棋",223],["徹夜",264]],["本当に？",["やっぱやる",179],["やんない",0],["やらないっつってんだろ",151]],["もうおそい",["あきらめる",-1],["最初に戻る",0],["いわもとのぼる",5]],
         ["連打しろ！！",["連打！",181],["連打！",181],["連打！",181]],["連打しろ！！",["連打！",182],["連打！",182],["連打！",182]],["連打しろ！！",["連打！",183],["連打！",180],["連打！",183]],
         ["連打しろ！！",["連打！",184],["連打！",184],["連打！",184]],["連打しろ！！",["連打！",185],["連打！",185],["連打！",185]],["連打しろ！！",["連打！",186],["連打！",186],["連打！",186]],
         ["連打しろ！！",["連打！",187],["連打！",187],["連打！",187]],["連打しろ！！",["連打！",188],["連打！",188],["連打！",188]],["連打しろ！！",["連打！",189],["連打！",189],["連打！",189]],
         ["連打しろ！！",["連打！",190],["連打！",190],["連打！",190]],["連打しろ！！",["連打！",191],["連打！",191],["連打！",191]],["連打しろ！！",["連打！",192],["連打！",192],["連打！",192]],
         ["連打しろ！！",["連打！",193],["連打！",193],["連打！",193]],["連打しろ！！",["連打！",194],["連打！",194],["連打！",194]],["連打しろ！！",["連打！",195],["連打！",195],["連打！",195]],
         ["連打しろ！！",["連打！",196],["連打！",196],["連打！",196]],["連打しろ！！",["連打！",197],["連打！",197],["連打！",197]],["連打しろ！！",["連打！",198],["連打！",198],["連打！",198]],
         ["連打しろ！！",["連打！",199],["連打！",199],["連打！",199]],["連打しろ！！",["連打！",200],["連打！",200],["連打！",200]],["連打しろ！！",["連打！",201],["連打！",201],["連打！",201]],
         ["連打しろ！！",["連打！",202],["連打！",202],["連打！",202]],["連打しろ！！",["連打！",203],["連打！",203],["連打！",203]],["連打しろ！！",["連打！",204],["連打！",204],["連打！",204]],
         ["連打しろ！！",["連打！",205],["連打！",205],["連打！",205]],["連打しろ！！",["連打！",206],["連打！",206],["連打！",206]],["連打しろ！！",["連打！",207],["連打！",207],["連打！",207]],
         ["連打しろ！！",["連打！",208],["連打！",208],["連打！",208]],["連打しろ！！",["連打！",209],["連打！",209],["連打！",209]],["連打しろ！！",["連打！",210],["連打！",210],["連打！",210]],
         ["連打しろ！！",["連打！",211],["連打！",211],["連打！",211]],["連打しろ！！",["連打！",212],["連打！",212],["連打！",212]],["連打しろ！！",["連打！",213],["連打！",213],["連打！",213]],
         ["連打しろ！！",["連打！",214],["連打！",214],["連打！",214]],["連打しろ！！",["連打！",215],["連打！",215],["連打！",215]],["連打しろ！！",["連打！",216],["連打！",216],["連打！",216]],
         ["押せ！！！",["↓　↓　↓",217],["ここを押せ！",218],["↑　↑　↑",217]],["押せ！！！",["↓　↓　↓",217],["ここを押せ！",219],["↑　↑　↑",217]],["ゲームクリア！！！　クリアコード：6",["クリア！",0],["ゲームオーバー！",9],["クリア！",0]],
         ["失敗...",["つづける",0],["やめる",-1],["のぼる",169]],["戦型を選べ！",["４六銀右急戦",225],["石田流",224],["ゴキゲン中飛車",224]],["戦型を選べ！",["４六銀右急戦",225],["横歩取り",226],["四間飛車",224]],
         ["戦型を選べ！",["六間飛車",227],["横歩取り",226],["鬼殺し",226]],["戦型を選べ！",["六間飛車",227],["真・江戸時代",230],["アルティメットパーフェクト囲い",231]],["囲いを選べ！",["美濃囲い",225],["振り飛車穴熊",233],["金無双",233]],
         ["駒を選べ！",["桂馬",234],["金将",234],["角行",226]],["方針を選べ！",["攻める",228],["守る",235],["バランス",235]],["方針を選べ！",["攻める",228],["守る",228],["バランス",228]],
         ["手筋を選べ！",["叩きの歩",229],["連打の歩",229],["ダンスの歩",236]],["勝ち方を選べ！",["詰み",237],["入玉",236],["時間切れ",236]],["初手を選べ！",["１六歩",236],["７六歩",-1],["７二銀",232]],
         ["初手を選べ！",["２六歩",236],["７六歩",232],["５八金左",236]],["決め手を放て！",["５三歩成！",237],["四桂宣告！",237],["王手飛車！",237]],["駒を選べ！",["桂馬",234],["金将",234],["角行",234]],
         ["方針を選べ！",["攻める",235],["守る",235],["バランス",235]],["勝ち方を選べ！",["詰み",236],["入玉",236],["時間切れ",236]],["敗北...",["まい",-1],["りま",8],["した",9]],
         ["勝利！！！　クリアコード：7",["ありがとう",0],["ございました",0],["感想戦",238]],["ここから先は有料です",["購入する",239],["購入する",239],["購入する",239]],["$100を振り込んでください",["わかった！",239],["わかった！",239],["わかった！",239]],
         ["徹夜ラッシュ！！",["起きる",241],["起きる",241],["起きる",252]],["一徹！",["起きる",242],["起きる",252],["起きる",242]],["二徹！",["起きる",243],["起きる",252],["起きる",252]],
         ["三徹！",["起きる",252],["起きる",252],["起きる",244]],["四徹！！",["起きる",252],["起きる",245],["起きる",252]],["五徹！！",["起きる",252],["起きる",246],["起きる",246]],
         ["六徹！！！",["起きる",247],["起きる",252],["起きる",252]],["七徹！！！",["起きる",248],["起きる",248],["起きる",252]],["八徹！！！！",["起きる",252],["起きる",249],["起きる",252]],
         ["九徹！！！！",["起きる",252],["起きる",250],["起きる",250]],["十徹！！！！！",["起きる",251],["起きる",252],["起きる",252]],["ゲームクリア！！　クリアコード：8",["起きる",18],["寝る",273],["のぼる",5]],
         ["寝てしまった...",["zzz",-1],["zzzz",-1],["zzzzz",274]],["徹夜ラッシュ！！",["起きる",241],["起きる",254],["起きる",254]],["一徹！",["起きる",242],["起きる",255],["起きる",255]],
         ["二徹！",["起きる",256],["起きる",243],["起きる",243]],["三徹！",["起きる",244],["起きる",244],["起きる",244]],["徹夜ラッシュ！！",["起きる",258],["起きる",258],["起きる",258]],
         ["一徹！",["起きる",259],["起きる",259],["起きる",255]],["二徹！",["起きる",260],["起きる",260],["起きる",256]],["三徹！",["起きる",244],["起きる",261],["起きる",261]],
         ["四徹！！",["起きる",245],["起きる",262],["起きる",245]],["五徹！！",["起きる",263],["起きる",263],["起きる",263]],["六徹！！！",["起きる",247],["起きる",247],["起きる",247]],
         ["徹夜ラッシュ！！",["起きる",265],["起きる",265],["起きる",265]],["一徹！",["起きる",266],["起きる",266],["起きる",259]],["二徹！",["起きる",267],["起きる",267],["起きる",260]],
         ["三徹！",["起きる",268],["起きる",261],["起きる",269]],["四徹！！",["起きる",269],["起きる",269],["起きる",262]],["五徹！！",["起きる",270],["起きる",270],["起きる",263]],
         ["六徹！！！",["起きる",247],["起きる",271],["起きる",271]],["七徹！！！",["起きる",272],["起きる",272],["起きる",272]],["八徹！！！！",["起きる",249],["起きる",249],["起きる",249]],
         ["おやすみ",["zzz",-1],["zzzz",-1],["zzzzz",274]],["寝るなボケ　ゲームオーバー",["のぼる",5],["のぼる",5],["のぼる",5]],["のぼるとウェディングケーキが合体していく...",["待つ",],["邪魔する",276],["逃げる",277]],
         ["邪魔すんな",["はい",278],["すみません",278],["逃げる",277]],["逃げんな",["はい",278],["すみません",278],["逃げる",277]],["ウェディングのぼる が あらわれた！",["たたかう",281],["さくせん",279],["にげる",999]],
         ["作戦とかねえよ",["もどる",278],["おどる",280],["のぼる",5]],["踊んな",["はい",278],["すみません",278],["逃げる",277]],["どうする？",["こうげき",284],["とくぎ",282],["じゅもん",283]],
         ["どうする？",["たべる",301],["ひゃくれつけん",302],["ちゅうどうかいかくれんごう",9]],["どうする？",["ふぁいやー",308],["とりぷるさんだー",324],["いんすたんとらーめん",348]],["ウェディングのぼるにはきかなかった！",["つぎへ",285],["つぎへ",285],["つぎへ",285]],
         ["ウェディングのぼるのこうげき！",["つぎへ",286],["つぎへ",287],["つぎへ",288]],["ボディプレス！！",["うける",289],["よける",290],["かうんたー",295]],["ウェディングのぼるはおもくてうごけない！",["つぎへ",294],["つぎへ",294],["つぎへ",278]],
         ["ひっさつ！オーバーカロリービッグバン！！",["うける",298],["よける",298],["かうんたー",298]],["ウェディングのぼるにつぶされた！",["つぎへ",300],["つぎへ",300],["つぎへ",300]],["どこによける？",["まえ",291],["みぎ",292],["した",293]],
         ["よけられなかった！",["つぎへ",300],["つぎへ",300],["つぎへ",300]],["ぎりぎりよけた！",["つぎへ",294],["つぎへ",294],["つぎへ",294]],["いけるわけないだろ",["つぎへ",300],["つぎへ",300],["つぎへ",300]],
         ["ふたたびのぼるのこうげき！",["つぎへ",288],["つぎへ",286],["つぎへ",287]],["選べ！",["かうんたー",297],["かうんたー",296],["かうんたー",296]],["失敗！",["つぎへ",289],["つぎへ",289],["つぎへ",289]],
         ["成功！ウェディングのぼるに2ダメージ！",["つぎへ",281],["つぎへ",281],["つぎへ",281]],["まばゆい光が全てをつつんでいく...",["つぎへ",299],["つぎへ",299],["つぎへ",299]],["世界は消滅した",["おわる",-1],["おわる",-1],["おわる",-1]],
         ["しんでしまった！ ゲームオーバー",["おわる",-1],["もどる",0],["のぼる",5]],["ほんの少しだけウェディングのぼるが減った！",["つぎへ",285],["つぎへ",285],["つぎへ",285]],["ウェディングのぼるに風穴があいた！",["つぎへ",303],["つぎへ",303],["つぎへ",303]], #300
         ["ウェディングのぼるは最後の一撃を放とうとしている！",["そしする",305],["ぼうぎょする",306],["にげる",304]],["逃げんな",["はい",303],["すみません",303],["逃げる",304]],["ウェディングのぼるが重すぎてそしできない！",["つぎへ",306],["つぎへ",306],["つぎへ",306]],
         ["ファイナルエターナルノボール！！",["つぎへ",307],["つぎへ",307],["つぎへ",307]],["宇宙が消し飛んだ",["おわる",-1],["おわる",-1],["おわる",-1]],["ウェディングのぼるにはきかなかった！",["つぎへ",309],["つぎへ",285],["つぎへ",285]],
         ["ウェディングのぼるの領域展開！",["つぎへ",310],["つぎへ",310],["つぎへ",310]],["「腹増身寿司」",["つぎへ",311],["つぎへ",311],["つぎへ",311]],["どうする？",["たたかう",312],["領域展開",314],["領域から逃げる",316]],
         ["必中効果により太ってしまった！",["こうげき",313],["とくぎ",313],["じゅもん",313]],["太りすぎてうごけない！",["つぎへ",319],["つぎへ",319],["つぎへ",319]],["領域展開！「〇〇〇〇」！",["無量空処",315],["政見放送",315],["な阪関無",315]],
         ["おまえに領域が展開できるわけねえだろ",["つぎへ",319],["つぎへ",319],["つぎへ",319]],["どっちに逃げる？",["うしろ",317],["ひだり",317],["うえ",318]],["領域の縁が見つからない！",["つぎへ",319],["つぎへ",319],["つぎへ",319]],
         ["領域から逃げ出せた！",["つぎへ",281],["つぎへ",281],["つぎへ",281]],["ウェディングのぼるのこうげき！",["つぎへ",320],["つぎへ",320],["つぎへ",320]],["極ノ番「飲」",["よける",321],["まもる",322],["のぼる",5]],
         ["領域内なのでよけられない！",["つぎへ",323],["つぎへ",323],["つぎへ",323]],["防御を貫通する威力だ！",["つぎへ",323],["つぎへ",323],["つぎへ",323]],["ウェディングのぼるに飲み込まれた！ゲームオーバー",["おわる",-1],["もどる",0],["のぼる",5]],
         ["一発目！",["ピカッ",325],["ドーン",328],["バリーン",325]],["命中！二発目！",["ビカッ",327],["ズドーン",326],["グシャーン",326]],["命中！三発目！",["ゴロゴロ",331],["ドッシャーン",332],["バゴーン",331]],
         ["不発！三発目！",["ゴロゴロ",334],["ドッシャーン",333],["バゴーン",333]],["不発！二発目！",["ビカッ",329],["ズドーン",329],["グシャーン",330]],["命中！三発目！",["ゴロゴロ",333],["ドッシャーン",333],["バゴーン",334]],
         ["不発！三発目！",["ゴロゴロ",335],["ドッシャーン",336],["バゴーン",335]],["命中！",["つぎへ",337],["つぎへ",337],["つぎへ",337]],["不発！",["つぎへ",338],["つぎへ",339],["つぎへ",338]],
         ["命中！",["つぎへ",338],["つぎへ",338],["つぎへ",339]],["不発！",["つぎへ",340],["つぎへ",340],["つぎへ",340]],["命中！",["つぎへ",340],["つぎへ",340],["つぎへ",340]],
         ["不発！",["つぎへ",341],["つぎへ",341],["つぎへ",341]],["ウェディングのぼるに超絶大ダメージ！！",["つぎへ",18],["つぎへ",18],["つぎへ",18]],["ウェディングのぼるに大ダメージ！",["つぎへ",342],["つぎへ",342],["つぎへ",342]],
         ["ウェディングのぼるに大ダメージ！",["つぎへ",343],["つぎへ",343],["つぎへ",343]],["ウェディングのぼるに効いている！",["つぎへ",285],["つぎへ",285],["つぎへ",285]],["ウェディングのぼるのカウンター！",["つぎへ",286],["つぎへ",286],["つぎへ",286]],
         ["ウェディングのぼるをたおした！",["つぎへ",0],["つぎへ",0],["つぎへ",345]],["ウェディングのぼるをたおした！",["つぎへ",344],["つぎへ",344],["つぎへ",344]],["ウェディングのぼるはゲームクリアしたそうにこちらをみている",["ゲー",346],["ムク",347],["リア",347]],
         ["ウェディングのぼるは煙草をおとした",["おわる",-1],["もどる",0],["のぼる",5]],["ゲームクリア！　クリアコード：9",["ないす",-1],["げーむ",-1],["くりあ",-1]],["ウェディングのぼるはさびしそうにさっていった",["おわる",-1],["もどる",0],["のぼる",5]],
         ["ウェディングのぼるはインスタントラーメンを食べた！",["つぎへ",350],["もう一杯",349],["つぎへ",350]],["ウェディングのぼるはさらにインスタントラーメンを食べた！",["つぎへ",89],["もう一杯",349],["つぎへ",89]],["ウェディングのぼるの重量が増えた！",["つぎへ",351],["もう一杯",349],["つぎへ",351]],
         ["もどれ",["もどる",350],["のぼる",5],["もどる",350]],["",["",],["",],["",]],["",["",],["",],["",]],#351-353
         ["",["",],["",],["",]],["",["",],["",],["",]],["",["",],["",],["",]],
         ["",["",],["",],["",]],["",["",],["",],["",]],["",["",],["",],["",]],
         ["",["",],["",],["",]],["",["",],["",],["",]],["",["",],["",],["",]],
         ["",["",],["",],["",]],["",["",],["",],["",]],["",["",],["",],["",]],]

todo = ["太らせる","ボディビル","78kg","101kg","お菓子をあげる","おなかをさわる","空中浮遊","青汁","発狂する","ホールケーキ","空　中　浮　遊"]
now = 0

def w(x):
    return x*WINDOW_WIDTH//100

def h(y):
    return y*WINDOW_HEIGHT//100

def btn_f(n):
    # print(n)
    global now
    now = story[now][n+1][1]
    if now == -1:
        root.destroy()
        return
    label.config(text=story[now][0])
    for i in range(btn_n):
        btn[i].config(text=story[now][i+1][0])


root = tk.Tk()
root.geometry(f"{WINDOW_WIDTH}x{WINDOW_HEIGHT}")

label = tk.Label(root, text=story[0][0], font=font)
label.place(x=w(10),y=h(40))

btn = []
for i in range(btn_n):
    btn.append(tk.Button(root, text=story[0][i+1][0], command=lambda index=i:btn_f(index), bg="white", width=36, font=font))
    btn[-1].place(x=w(55),y=h(i*20+20))

root.mainloop()